app/controllers/albums_controller.rb

  def create
     @albumCheck = Album.where(image_id: album_params[:image_id])
        #  render json: album_params
    if @albumCheck == nil || @albumCheck == []
          @album = Album.new(album_params)
          if @album.save
---
INSERT INTO "albums" ("img_src", "created_at", "updated_at", "dbx_user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["img_src", "/anothertimage.jpg"], ["created_at", "2020-05-23 18:41:55.582106"], ["updated_at", "2020-05-23 18:41:55.582106"], ["dbx_user_id", "dbid:AAC0kpxvzYaXF5xqVPwR68zdH8hvLT-_TlY"]]

  def show
    # tagsArr = JSON.parse(params[:tags])
    @albums = Album.where(dbx_user_id: params[:user_id]).in(tags: params[:tags])
---
SELECT "albums".* FROM "albums" WHERE "albums"."dbx_user_id" = $1  [["dbx_user_id", "1"]]