app/controllers/users_controller.rb

INSERT INTO "users" ("last_access_token", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "dbx_id"  [["last_access_token", "_17QeseHT6IAAAAAAAIc8Ro9oskWETFe2zLQ1xUAl2Yr0Hp6cO6njBx5BQl5Ueou"], ["created_at", "2020-05-23 16:51:40.674806"], ["updated_at", "2020-05-23 16:51:40.674806"]]
---
  def create
    @user = User.new(user_params)

    if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
    def set_user
      #lookup by dbx_id instead of default id
      @user = User.find(params[:id])